tap "heroku/brew"
tap "nikitabobko/tap"
tap "withgraphite/tap"

# Improved shell history for zsh, bash, fish and nushell
brew "atuin", restart_service: :changed
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Modern, maintained replacement for ls
brew "eza"
# Command-line fuzzy finder written in Go
brew "fzf"
# Distributed revision control system
brew "git"
# GNU Privacy Guard (OpenPGP)
brew "gnupg"
# Add GitHub support to git on the command-line
brew "hub"
# Postgres C API library
brew "libpq"
# NaCl networking and cryptography library
brew "libsodium"
# YAML Parser
brew "libyaml"
# Polyglot runtime manager (asdf rust clone)
brew "mise"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Process manager for Procfile-based applications and tmux
brew "overmind"
# CLI for Postgres with auto-completion and syntax highlighting
brew "pgcli"
# Unix pager optimized for psql
brew "pspg"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Cross-shell prompt for astronauts
brew "starship"
# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Pluggable terminal workspace, with terminal multiplexer as the base feature
brew "zellij"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# UNIX shell (command interpreter)
brew "zsh"
# AeroSpace is an i3-like tiling window manager for macOS
cask "aerospace"
# Voice and text chat software
cask "discord"
# Web browser
cask "firefox"
# Tools to protect your emails and files
cask "gpg-suite"
# Keyboard customiser
cask "karabiner-elements"
# GPU-based terminal emulator
cask "kitty"
# Customise mouse behavior
cask "linearmouse"
# Clipboard manager
cask "maccy"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# Replacement for Docker Desktop
cask "raycast"
# Move and resize windows using keyboard shortcuts or snap areas
cask "rectangle"
# Screenshot measurement and annotation tool
cask "shottr"
# System monitor for the menu bar
cask "stats"
